import whisper

model = whisper.load_model("large") #[base large medium smaill]
result = model.transcribe("bth.wav")
print(result["text"])

# Raw กรุงเทพมหานครได้ชื่อว่าเมืองที่มีชื่อยาวที่สุดในโลกบันทึกไว้ในกินเนสส์บุ๊ก -> audio.wav


#base ของเทพมาหารของได้ชื่อว่าเหมือนที่มีชื่ออย่าที่สุดในโลกบันทึกไว้ในกินSbook
#small ครงเทพมาหารคอร์ได้ชื่อว่ามือกินที่มีชื่ออย่าที่สุดในโลกบันทึกไว้ในกินเนสบูก
#medium ครุงเทพมหานครได้ชื่อว่ามืองที่มีชื่อหยาดที่สุดในโลกบรรธึกไว้ในกินเนสบุก
#large ครุงเทพมหานครได้ชื่อว่ามืองที่มีชื่อยาวที่สุดในโลกบรรทึกไว้ในกินเนสบุ๊ก

#raw
# ตอนอยู่ที่แหล่งสถานคุนหลุน เขาเคยฆ่ามกุฎมหาอริยะที่อันดับสูงกว่าชื่อหลิงจื่อมานับไม่ถ้วน อย่างเช่นซวีหลิงคุน กู่ฉางซิน ไหนเลยจะเห็นคนพวกนี้อยู่ในสายตา
# ยิ่งไม่ต้องพูดถึงว่าต่อให้หลินสวินไม่สมัครใจ ก็ไม่อาจไม่ยอมรับความจริงเรื่องหนึ่ง
# นั่นก็คือเขาในตอนนี้เป็นอันดับหนึ่งบนกระดานมหาอริยะฟ้าดาราแล้ว

#medium
# ตอนอยู่ที่หลังสถานคุณลุน เขาเคยค่ามกุตมาหาริยะที่อันดับสูงกว่าชื่อลิงจือมานับไม่ทวนอย่างเช่นสวิลิงคุณกุชังซินไหนเลยจะเห็นคนพวกนี้อยู่ในสายตา
# ยิ่งไม่ต้องพูดถึงว่าต่อให้ลินซวินไม่สมัครใจก็ไม่อาจไม่ยอมรับความจริงเรื่องหนึ่ง
# นั้นก็คือเขาในตอนนี้เป็นอันดับหนึ่งบนกระดานมหาริยะฟ้าดาราแล้ว

#large
# ตอนอยู่ที่แหลงสถานคุณลุนเขาเคยข้ามมากุฐมหาอริยะที่อันดับสูงกว่าชื่อลิงจือมานับไม่ทวนอย่างเช่น ซาวีลิงคุณกุชังซินไหนเลยจะเห็นคนพวกนี้อยู่ในสายตา
# ยิ่งไม่ต้องพูดถึงว่าต่อให้ลินซวินไม่สมัครใจก็ไม่อาจไม่ยอมรับความจริงเรื่องหนึ่ง
# นั่นก็คือเขานี้ตอนนี้เป็นอันดับหนึ่งบนกระดานมหาอริยะฟ้าดาราแล้ว

#watch location models cd /Users/kanit/.cache/whisper/ && ll
# th to eng whisper audio.flac audio.mp3 audio.wav --model medium
